import React from 'react'
import Navbar  from '../components/navbar.jsx'
import Footer  from '../components/footer.jsx'

const About = () => {
  return(
    <div>
        <Navbar/>

        {/* start Whous section  */}
        <div className='my-15'> 
             <div className=' container m-auto text-center '>
                <h1 className='mt-2 text-3xl leading-8 font-extrabold tracking-tight text-gray-800 sm:text-4xl'>
                    ما هي منصة مسار ؟
                </h1>
                <p className='mt-10 text-xl text-gray-600  m-auto'>
                "مسار "هي منصة تعليمية مبتكرة تهدف إلى دعم الطلاب والمتعلمين في مجالات تقنية المعلومات والبرمجة والتصميم.
                 تم تطويرها لتكون مرجعًا شاملاً يوفر الأدوات والكورسات والنصائح التي تساعد الأفراد على اكتساب المعرفة وصقل المهارات المطلوبة في العصر الرقمي.
                  تتميز المنصة بتنظيم محتواها بشكل يضمن سهولة الوصول إلى الموارد، بدءًا من أساسيات التعلم وحتى المستويات المتقدمة.
                  كما تقدم تجربة تعليمية تفاعلية من خلال دمج المصادر المتنوعة مع نصائح عملية تساعد على تطبيق المعرفة بشكل فعّال. الرؤية الأساسية لمنصة "مسار"
                  هي بناء مجتمع تعليمي متكامل يساعد الأفراد على اكتشاف إمكانياتهم ومواكبة التطور التكنولوجي لتحقيق طموحاتهم الأكاديمية والمهنية.
                </p>
            </div>
        </div>
        {/* end Whous section  */}


        {/* start vision section  */}
        <div className='my-15'>
        <div className=' container m-auto text-center '>
                <h1 className='mt-2 text-3xl leading-8 font-extrabold tracking-tight text-gray-800 sm:text-4xl'>
                    رؤية المنصة
                </h1>
                <p className='mt-10 text-xl text-gray-600  m-auto'>
                "مسار "هي منصة تعليمية مبتكرة تهدف إلى دعم الطلاب والمتعلمين في مجالات تقنية المعلومات والبرمجة والتصميم.
                 تم تطويرها لتكون مرجعًا شاملاً يوفر الأدوات والكورسات والنصائح التي تساعد الأفراد على اكتساب المعرفة وصقل المهارات المطلوبة في العصر الرقمي.
                  تتميز المنصة بتنظيم محتواها بشكل يضمن سهولة الوصول إلى الموارد، بدءًا من أساسيات التعلم وحتى المستويات المتقدمة.
                  كما تقدم تجربة تعليمية تفاعلية من خلال دمج المصادر المتنوعة مع نصائح عملية تساعد على تطبيق المعرفة بشكل فعّال. الرؤية الأساسية لمنصة "مسار"
                  هي بناء مجتمع تعليمي متكامل يساعد الأفراد على اكتشاف إمكانياتهم ومواكبة التطور التكنولوجي لتحقيق طموحاتهم الأكاديمية والمهنية.
                </p>
            </div>
        </div>
        {/* end vision section  */}

        <Footer/>
    </div>
  );
}


export default About